<template>
  <h2>Greek-to-Chinese (古)希腊语音译</h2>

  <pre>
    一个用于将(古)希腊语映射为中文的工具，与翻译软件不同，每个音节都有唯一对应的中文音译。
    目前支持呼气符号和分音符号，不支持重音、长音、短音和下标符号。
    更推荐用于现代希腊语，古希腊语发音规则较复杂。
  </pre>

  <pre>
    单元音（7个）：α，ε，η，ι，ο，υ，ω；
    双元音（8个）：αι，αυ，ει，ευ，οι，ου，υι，ηυ；（来源：古希腊语简明教程-孙周兴）
    辅音（17个）：β，γ，δ，ζ，θ，κ，λ，μ，ν，ξ，π，ρ，σ/ς，τ，φ，χ，ψ。
  </pre>

  <pre>
    音节划分规则（‘v’代表单元音或双元音，‘c’代表辅音,辅音的长度为0-2）：
    (...vc)(cvc)...(cvc)(cv...)
  </pre>

  <pre>
    基础使用方法：
    1.输入希腊文和中文，点击‘+’；
    2.如果有多种音节划分方式，选择一种；
    3.如果程序无法自动匹配，选择音节对应的中文；
    4.确认后程序会保存（单词，音节列表）和（音节，发音）。
  </pre>

  <pre>
    进阶使用方法：
    1.如果已经保存了大量音节，输入希腊文，点击‘+’；
    2.如果有多种音节划分方式，选择一种；
    3.程序自动匹配中文；
    4.确认后程序会保存（单词，音节列表）。
  </pre>

  <pre> 此项目使用Electron，Vite，Vue 3和Naive UI开发。 </pre>

  <pre> v0.1.1 </pre>

  <pre> https://github.com/FreedomRangerH/Greek-to-Chinese </pre>
</template>
